[
  {
    "imageUrls": [
      "/src/images/projects/appChamadaAlunos/img1.png",
      "/src/images/projects/appChamadaAlunos/img2.png",
      "/src/images/projects/appChamadaAlunos/img3.png",
      "/src/images/projects/appChamadaAlunos/img4.png"
    ],
    "siteUrl": "https://example.com/site1",
    "description": "Desenvolvi um site para controle de chamadas utilizando React, SQL, PHP e Tailwind. O aplicativo permite o cadastro de alunos, docentes e turmas. Fui responsável por criar as relações entre as tabelas, implementar um design responsivo e desenvolver o back-end para realizar operações CRUD."
  },
  {
    "imageUrls": [
      "/src/images/projects/listaDeTarefas/img1.png",
      "/src/images/projects/listaDeTarefas/img2.png",
      "/src/images/projects/listaDeTarefas/img3.png",
      "/src/images/projects/listaDeTarefas/img4.png"
    ],
    "siteUrl": "https://example.com/site2",
    "description": "Criei uma Lista de Tarefas responsiva e funcional usando HTML, CSS e JavaScript. O projeto permite adicionar, editar e remover tarefas, oferecendo uma experiência intuitiva em diversos dispositivos."
  },
  {
    "imageUrls": [
      "/src/images/projects/myFirstPortfolio/img1.png",
      "/src/images/projects/myFirstPortfolio/img2.png",
      "/src/images/projects/myFirstPortfolio/img3.png",
      "/src/images/projects/myFirstPortfolio/img4.png",
      "/src/images/projects/myFirstPortfolio/img5.png"
    ],
    "siteUrl": "https://example.com/site3",
    "description": "Este foi meu primeiro portfólio pessoal, desenvolvido para aprimorar minhas habilidades e conhecimentos. Utilizei Bootstrap para um design responsivo e estilizado, e combinei JavaScript, HTML e CSS para criar uma interface intuitiva. Esse projeto foi fundamental para melhorar meu conhecimento e experiência no desenvolvimento web."
  },
  {
    "imageUrls": [
      "/src/images/projects/siteCorretor/img1.png",
      "/src/images/projects/siteCorretor/img2.png",
      "/src/images/projects/siteCorretor/img3.png",
      "/src/images/projects/siteCorretor/img4.png"
    ],
    "siteUrl": "",
    "description": "Este projeto é um site desenvolvido para um corretor de imóveis, utilizando React e Tailwind. A aplicação oferece uma plataforma intuitiva e eficiente para o gerenciamento de propriedades. O corretor pode adicionar, editar e remover imóveis, cada um com detalhes como fotos, preços e descrições. O design responsivo garante que o site seja visualmente atraente e funcional em qualquer dispositivo. O deploy e gerenciamento da aplicação são realizados no Google Cloud, assegurando alta disponibilidade e desempenho confiável."
  }
]
